
CODE = 'YOU TOKEN'

text = f'''
<b>Я могу быть вам полезна:</b>
⠀
✔️если вам необходима услуга комплексного ведения аккаунта (SMM)
⠀
✔️ если вам нужна консультация по блогу.
Вы не понимаете почему нет продаж и блог не растет. Помогу разобраться именно с вашей ситуацией, выстроить стратегию развития и роста аккаунта.
Отвечу на все ваши вопросы.
⠀
✔️ так же если вы новичок в Instagram, но хотите тут зарабатывать. Вы можете прийти ко мне в личную работу или на курс «Smm с 0».'''


text2 = ('''<b>Комплексное ведение аккаунта, SMM</b>

<b>Для кого данная услуга?</b>

✔ У вас нет времени на создание контента и ведение социальных сетей,

✔ У вас нет/мало навыков работы в инстаграм, но понимаете что вести его необходимо,

✔ Хотите увеличить прибыль, привлекать клиентов онлайн

✔ Хотите, что бы у вас было больше свободного времени на себя и свою семью, а не на создание сторис, рилс и написание постов

    <b>Что входит в услугу?</b>

- изучение вашей ниши

- подробный анализ и сегментирование целевой аудитории

- анализ конкурентов

- стратегия продвижения

- продающая визуальная упаковка профиля наполненная смыслами, которые будут откликаться вашей ЦА: оформление шапки профиля,
наполнение контентом вечных сторис, оформление заставок, создание визуала

- контент-план на 12 публикаций в месяц (пост/Reels)

- копирайтинг: написание постов или редактирование ваших(12 шт. в месяц)

- контент-план для сторис (на месяц)

- оформление сторис 6шт в день

- подбор идей для Reels и монтаж, подбор идей для фото

- подбор блогеров для рекламы, написание для них ТЗ (до 3 в месяц)

- подбор целевых хештегов

- одноразовое создание чек-листа / гайда для вашей аудитории(приветственное письмо)
        

    <b>Что вы получите:</b>

- клиентов и прибыль

- отстройку от конкурентов и узнаваемость вашего бренда

- продвижение ваших продуктов / услуг

- свободное время для более важных вещей, вам не придется ломать голову что сегодня выложить и где взять контент

- ведение аккаунта без простоев и задержек с контентом

- ответственного smm-специалиста, ответственного и заинтересованного в продвижении вашего бизнеса
___________________________________
<b>Стоимость пакета: 25 000 р/месяц
Съемка контента оплачивается отдельно - 2 500р/час</b>''')


text3 = '''<b>Консультация по блогу</b>

    <b>Кому нужна консультация?</b>

✔ для тех, кто самостоятельно ведет свой коммерческий / экспертный аккаунт, реализует в нем продукты / услуги

✔ вы не понимаете почему на вас плохо подписываются и нет продаж

✔ вам не понятно, как оформить блог и какие ошибки / пробелы есть в вашем аккаунте

✔ не понимаете, как двигаться дальше, не можете определиться с позиционированием, как определить свою ЦА, какой контент
 нужен для вас и вашей аудитории и какие смыслы в него закладывать
 
✔ как вести блог не выгорая и находить идеи для контента

    <b>Что необходимо для консультации?</b>

- ответить подробно на все вопросы в брифе(высылаю по запросу)

    <b>Что входит в услугу?</b>

- анализ вашего профиля на текущий момент, анализ вашего запроса / цели

- составление четкой стратегии работы в блоге, исходя из ваших целей, весь материал оформляется в презентацию и остается у вас навсегда.

- консультация 1,5 - 2 часа онлайн / офлайн 

- сопровождение в течении 14 дней после консультации, где вы можете задать мне все возникающие вопросы

- дополнительные материалы по запросу выборочно (инструкции, видео-уроки, скрипты и тд.)


___________________________________
<b>Стоимость 7 000р 
 Сроки выполнения подготовки к консультации до 7 дней.</b>'''



text4 = '''Программа обучения:
⠀
1. Вводная лекция. 

1.1 Безопасность.

1.2 Целевая аудитоия и брифинг.
        ⠀
        
2. Оформление шапки профиля.

2.1. Позиционирование и УТП.
        ⠀
        
3. Визуальное оформление ленты.

3.1 Базовые правила съемки и компановки ленты.
        ⠀
        
4. Виды текстового контента.

4.1 Учимся писать текст.
        ⠀
        
5. Сторис. Вовлечение. Работа со статистикой.
        ⠀
        
6. Продвижение блога.

6.1 Бесплатные методы.

6.2 Продвижение с помощью Reels.
        
6.3 Реклама у блогеров.
        ⠀
        
7. Оформление кейса. Рекомендации по поиску клиентов.

7.1 Лайфхаки в работе.
⠀
Бонус: обучающие уроки по ВК в записи.'''























